In [87]:
################################ Selecting Rows and Columns ###################################

In [89]:
# Create dataframe from dictionary
import pandas as pd
dict={
    "f_name":["Sony","Pragya","Prasanna","Ram","Hari","Sita"],
    "l_name":["Shrestha","Shrestha","Shrestha","Prasad","Kumar","Giri"],
    "age":[24,27,19,24,27,19]
}
df=pd.DataFrame(dict)
df

    f_name    l_name  age
0     Sony  Shrestha   24
1   Pragya  Shrestha   27
..     ...       ...  ...
4     Hari     Kumar   27
5     Sita      Giri   19

[6 rows x 3 columns]

In [90]:
# Select only specific column
df["f_name"]
df.age

0    24
1    27
     ..
4    27
5    19
Name: age, Length: 6, dtype: int64

In [91]:
# Select few columns
df[["f_name","l_name"]]

    f_name    l_name
0     Sony  Shrestha
1   Pragya  Shrestha
..     ...       ...
4     Hari     Kumar
5     Sita      Giri

[6 rows x 2 columns]

In [92]:
type(df["f_name"]) # This is Series

pandas.core.series.Series

In [93]:
# Get list of all columns
df.columns

Index(['f_name', 'l_name', 'age'], dtype='object')

In [94]:
# Select one row
df.iloc[0]

f_name        Sony
l_name    Shrestha
age             24
Name: 0, dtype: object

In [95]:
# Select multiple rows
df.iloc[[0,1]]

   f_name    l_name  age
0    Sony  Shrestha   24
1  Pragya  Shrestha   27

In [96]:
# Select multiple rows
df.iloc[0:2]

   f_name    l_name  age
0    Sony  Shrestha   24
1  Pragya  Shrestha   27

In [97]:
# Select multiple rows
df.iloc[1:]

     f_name    l_name  age
1    Pragya  Shrestha   27
2  Prasanna  Shrestha   19
3       Ram    Prasad   24
4      Hari     Kumar   27
5      Sita      Giri   19

In [98]:
# Select multiple rows and columns
df.iloc[1:,1:]

     l_name  age
1  Shrestha   27
2  Shrestha   19
3    Prasad   24
4     Kumar   27
5      Giri   19

In [99]:
# Select multiple rows and columns
df.loc[1:,["f_name"]]

     f_name
1    Pragya
2  Prasanna
3       Ram
4      Hari
5      Sita

In [100]:
# Select multiple rows and columns
df.loc[1:,"f_name":"l_name"]

     f_name    l_name
1    Pragya  Shrestha
2  Prasanna  Shrestha
3       Ram    Prasad
4      Hari     Kumar
5      Sita      Giri

In [101]:
# Count by distinct values
df["age"].value_counts()

19    2
27    2
24    2
Name: age, dtype: int64